GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32m531r(b-z-c)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC0_IN0 */
#define ADC0_IN0_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC0_IN1 */
#define ADC0_IN1_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC0_IN2 */
#define ADC0_IN2_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC0_IN3 */
#define ADC0_IN3_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC0_IN4 */
#define ADC0_IN4_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* ADC0_IN5 */
#define ADC0_IN5_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* ADC0_IN6 */
#define ADC0_IN6_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)

/* ADC0_PROC */
#define ADC0_PROC_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)
#define ADC0_PROC_PN7 \
	GD32_PINMUX_AF('N', 7, AF5)

/* ADC0_TRG */
#define ADC0_TRG_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)

/* ADC2_IN0 */
#define ADC2_IN0_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)

/* ADC2_IN1 */
#define ADC2_IN1_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)

/* ADC2_IN2 */
#define ADC2_IN2_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)

/* ADC2_IN3 */
#define ADC2_IN3_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)

/* ADC2_IN4 */
#define ADC2_IN4_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)

/* ADC2_IN5 */
#define ADC2_IN5_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)

/* ADC2_IN6 */
#define ADC2_IN6_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC2_IN7 */
#define ADC2_IN7_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ADC2_IN9 */
#define ADC2_IN9_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)

/* ADC2_PROC */
#define ADC2_PROC_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)

/* ADC2_TRG */
#define ADC2_TRG_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define ADC2_TRG_PF8 \
	GD32_PINMUX_AF('F', 8, AF5)

/* ADCSM1 */
#define ADCSM1_PF10 \
	GD32_PINMUX_AF('F', 10, AF5)

/* ADCSM2 */
#define ADCSM2_PF9 \
	GD32_PINMUX_AF('F', 9, AF5)

/* ADCSM3 */
#define ADCSM3_PF10 \
	GD32_PINMUX_AF('F', 10, AF10)

/* ADCSM4 */
#define ADCSM4_PF9 \
	GD32_PINMUX_AF('F', 9, AF10)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)
#define ANALOG_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)
#define ANALOG_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)
#define ANALOG_PD8 \
	GD32_PINMUX_AF('D', 8, ANALOG)
#define ANALOG_PD9 \
	GD32_PINMUX_AF('D', 9, ANALOG)
#define ANALOG_PD10 \
	GD32_PINMUX_AF('D', 10, ANALOG)
#define ANALOG_PD11 \
	GD32_PINMUX_AF('D', 11, ANALOG)
#define ANALOG_PD12 \
	GD32_PINMUX_AF('D', 12, ANALOG)
#define ANALOG_PD13 \
	GD32_PINMUX_AF('D', 13, ANALOG)
#define ANALOG_PD14 \
	GD32_PINMUX_AF('D', 14, ANALOG)
#define ANALOG_PE8 \
	GD32_PINMUX_AF('E', 8, ANALOG)
#define ANALOG_PE9 \
	GD32_PINMUX_AF('E', 9, ANALOG)
#define ANALOG_PE10 \
	GD32_PINMUX_AF('E', 10, ANALOG)
#define ANALOG_PE11 \
	GD32_PINMUX_AF('E', 11, ANALOG)
#define ANALOG_PE12 \
	GD32_PINMUX_AF('E', 12, ANALOG)
#define ANALOG_PE13 \
	GD32_PINMUX_AF('E', 13, ANALOG)
#define ANALOG_PE14 \
	GD32_PINMUX_AF('E', 14, ANALOG)
#define ANALOG_PF8 \
	GD32_PINMUX_AF('F', 8, ANALOG)
#define ANALOG_PF9 \
	GD32_PINMUX_AF('F', 9, ANALOG)
#define ANALOG_PF10 \
	GD32_PINMUX_AF('F', 10, ANALOG)
#define ANALOG_PF11 \
	GD32_PINMUX_AF('F', 11, ANALOG)
#define ANALOG_PF12 \
	GD32_PINMUX_AF('F', 12, ANALOG)
#define ANALOG_PF13 \
	GD32_PINMUX_AF('F', 13, ANALOG)
#define ANALOG_PF14 \
	GD32_PINMUX_AF('F', 14, ANALOG)
#define ANALOG_PG11 \
	GD32_PINMUX_AF('G', 11, ANALOG)
#define ANALOG_PG12 \
	GD32_PINMUX_AF('G', 12, ANALOG)
#define ANALOG_PG13 \
	GD32_PINMUX_AF('G', 13, ANALOG)
#define ANALOG_PG14 \
	GD32_PINMUX_AF('G', 14, ANALOG)
#define ANALOG_PG15 \
	GD32_PINMUX_AF('G', 15, ANALOG)
#define ANALOG_PN2 \
	GD32_PINMUX_AF('N', 2, ANALOG)
#define ANALOG_PN5 \
	GD32_PINMUX_AF('N', 5, ANALOG)
#define ANALOG_PN6 \
	GD32_PINMUX_AF('N', 6, ANALOG)
#define ANALOG_PN7 \
	GD32_PINMUX_AF('N', 7, ANALOG)

/* BOOT */
#define BOOT_PN6 \
	GD32_PINMUX_AF('N', 6, ANALOG)

/* CAN0_RX */
#define CAN0_RX_PB2 \
	GD32_PINMUX_AF('B', 2, AF13)
#define CAN0_RX_PF12 \
	GD32_PINMUX_AF('F', 12, AF8)
#define CAN0_RX_PF14 \
	GD32_PINMUX_AF('F', 14, AF8)

/* CAN0_TX */
#define CAN0_TX_PF11 \
	GD32_PINMUX_AF('F', 11, AF8)
#define CAN0_TX_PF13 \
	GD32_PINMUX_AF('F', 13, AF8)
#define CAN0_TX_PG15 \
	GD32_PINMUX_AF('G', 15, AF8)

/* CFMUREF */
#define CFMUREF_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define CFMUREF_PF11 \
	GD32_PINMUX_AF('F', 11, AF5)

/* CK_OUT */
#define CK_OUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF0)
#define CK_OUT_PF12 \
	GD32_PINMUX_AF('F', 12, AF0)

/* CMP0_INP1 */
#define CMP0_INP1_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* CMP0_INP2 */
#define CMP0_INP2_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* CMP0_INP3 */
#define CMP0_INP3_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)

/* CMP0_INP4 */
#define CMP0_INP4_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)

/* CMP0_OUT */
#define CMP0_OUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)

/* CMP1_INP1 */
#define CMP1_INP1_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* CMP1_INP2 */
#define CMP1_INP2_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* CMP1_INP3 */
#define CMP1_INP3_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)

/* CMP1_INP4 */
#define CMP1_INP4_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* CMP1_OUT */
#define CMP1_OUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)

/* CMP2_INP1 */
#define CMP2_INP1_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* CMP2_INP2 */
#define CMP2_INP2_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)

/* CMP2_INP3 */
#define CMP2_INP3_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)

/* CMP2_INP4 */
#define CMP2_INP4_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* CMP2_INP5 */
#define CMP2_INP5_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)

/* CMP2_OUT */
#define CMP2_OUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF8)

/* CMP3_INP1 */
#define CMP3_INP1_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* CMP3_INP3 */
#define CMP3_INP3_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)

/* CMP3_INP4 */
#define CMP3_INP4_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)

/* CMP3_INP5 */
#define CMP3_INP5_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)

/* CMP3_OUT */
#define CMP3_OUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF8)

/* CMP_INN1 */
#define CMP_INN1_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)

/* CMP_INN2 */
#define CMP_INN2_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)

/* CPTIMERW_IC0 */
#define CPTIMERW_IC0_PF13 \
	GD32_PINMUX_AF('F', 13, AF0)

/* CPTIMERW_IC1 */
#define CPTIMERW_IC1_PF10 \
	GD32_PINMUX_AF('F', 10, AF0)

/* CPTIMERW_OC0 */
#define CPTIMERW_OC0_PF14 \
	GD32_PINMUX_AF('F', 14, AF0)

/* CPTIMERW_OC1 */
#define CPTIMERW_OC1_PF11 \
	GD32_PINMUX_AF('F', 11, AF0)

/* DAC0_OUT0 */
#define DAC0_OUT0_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)

/* DAC0_OUT1 */
#define DAC0_OUT1_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF15)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF15)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF15)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF15)
#define EVENTOUT_PF8 \
	GD32_PINMUX_AF('F', 8, AF15)
#define EVENTOUT_PF9 \
	GD32_PINMUX_AF('F', 9, AF15)
#define EVENTOUT_PF10 \
	GD32_PINMUX_AF('F', 10, AF15)
#define EVENTOUT_PF11 \
	GD32_PINMUX_AF('F', 11, AF15)
#define EVENTOUT_PF12 \
	GD32_PINMUX_AF('F', 12, AF15)
#define EVENTOUT_PF13 \
	GD32_PINMUX_AF('F', 13, AF15)
#define EVENTOUT_PF14 \
	GD32_PINMUX_AF('F', 14, AF15)
#define EVENTOUT_PG11 \
	GD32_PINMUX_AF('G', 11, AF15)
#define EVENTOUT_PG12 \
	GD32_PINMUX_AF('G', 12, AF15)
#define EVENTOUT_PG13 \
	GD32_PINMUX_AF('G', 13, AF15)
#define EVENTOUT_PG14 \
	GD32_PINMUX_AF('G', 14, AF15)
#define EVENTOUT_PG15 \
	GD32_PINMUX_AF('G', 15, AF15)
#define EVENTOUT_PN2 \
	GD32_PINMUX_AF('N', 2, AF15)
#define EVENTOUT_PN6 \
	GD32_PINMUX_AF('N', 6, AF15)
#define EVENTOUT_PN7 \
	GD32_PINMUX_AF('N', 7, AF15)

/* GPTIMER0_CH0 */
#define GPTIMER0_CH0_PF8 \
	GD32_PINMUX_AF('F', 8, AF11)
#define GPTIMER0_CH0_PF10 \
	GD32_PINMUX_AF('F', 10, AF11)
#define GPTIMER0_CH0_PG13 \
	GD32_PINMUX_AF('G', 13, AF10)
#define GPTIMER0_CH0_PG15 \
	GD32_PINMUX_AF('G', 15, AF10)

/* GPTIMER0_CH0_INV */
#define GPTIMER0_CH0_INV_PF8 \
	GD32_PINMUX_AF('F', 8, AF13)
#define GPTIMER0_CH0_INV_PF10 \
	GD32_PINMUX_AF('F', 10, AF13)
#define GPTIMER0_CH0_INV_PG13 \
	GD32_PINMUX_AF('G', 13, AF12)
#define GPTIMER0_CH0_INV_PG15 \
	GD32_PINMUX_AF('G', 15, AF12)

/* GPTIMER0_CH1 */
#define GPTIMER0_CH1_PF9 \
	GD32_PINMUX_AF('F', 9, AF11)
#define GPTIMER0_CH1_PG11 \
	GD32_PINMUX_AF('G', 11, AF13)
#define GPTIMER0_CH1_PG12 \
	GD32_PINMUX_AF('G', 12, AF10)
#define GPTIMER0_CH1_PG14 \
	GD32_PINMUX_AF('G', 14, AF10)

/* GPTIMER0_CH1_INV */
#define GPTIMER0_CH1_INV_PF9 \
	GD32_PINMUX_AF('F', 9, AF13)
#define GPTIMER0_CH1_INV_PG11 \
	GD32_PINMUX_AF('G', 11, AF14)
#define GPTIMER0_CH1_INV_PG12 \
	GD32_PINMUX_AF('G', 12, AF12)
#define GPTIMER0_CH1_INV_PG14 \
	GD32_PINMUX_AF('G', 14, AF12)

/* GPTIMER0_CPPO */
#define GPTIMER0_CPPO_PA9 \
	GD32_PINMUX_AF('A', 9, AF14)
#define GPTIMER0_CPPO_PD8 \
	GD32_PINMUX_AF('D', 8, AF14)
#define GPTIMER0_CPPO_PF12 \
	GD32_PINMUX_AF('F', 12, AF14)

/* GPTIMER1_CH0 */
#define GPTIMER1_CH0_PC8 \
	GD32_PINMUX_AF('C', 8, AF11)
#define GPTIMER1_CH0_PF14 \
	GD32_PINMUX_AF('F', 14, AF11)
#define GPTIMER1_CH0_PG15 \
	GD32_PINMUX_AF('G', 15, AF11)

/* GPTIMER1_CH0_INV */
#define GPTIMER1_CH0_INV_PC8 \
	GD32_PINMUX_AF('C', 8, AF13)
#define GPTIMER1_CH0_INV_PF14 \
	GD32_PINMUX_AF('F', 14, AF13)
#define GPTIMER1_CH0_INV_PG15 \
	GD32_PINMUX_AF('G', 15, AF13)

/* GPTIMER1_CH1 */
#define GPTIMER1_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF10)
#define GPTIMER1_CH1_PF13 \
	GD32_PINMUX_AF('F', 13, AF11)
#define GPTIMER1_CH1_PG14 \
	GD32_PINMUX_AF('G', 14, AF11)

/* GPTIMER1_CH1_INV */
#define GPTIMER1_CH1_INV_PA9 \
	GD32_PINMUX_AF('A', 9, AF12)
#define GPTIMER1_CH1_INV_PF13 \
	GD32_PINMUX_AF('F', 13, AF13)
#define GPTIMER1_CH1_INV_PG14 \
	GD32_PINMUX_AF('G', 14, AF13)

/* GPTIMER1_CPPO */
#define GPTIMER1_CPPO_PE14 \
	GD32_PINMUX_AF('E', 14, AF14)

/* GTOC0_IN */
#define GTOC0_IN_PA1 \
	GD32_PINMUX_AF('A', 1, AF10)
#define GTOC0_IN_PA9 \
	GD32_PINMUX_AF('A', 9, AF11)
#define GTOC0_IN_PD8 \
	GD32_PINMUX_AF('D', 8, AF10)
#define GTOC0_IN_PE14 \
	GD32_PINMUX_AF('E', 14, AF10)
#define GTOC0_IN_PF12 \
	GD32_PINMUX_AF('F', 12, AF10)
#define GTOC0_IN_PG13 \
	GD32_PINMUX_AF('G', 13, AF11)

/* GTOC1_IN */
#define GTOC1_IN_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)
#define GTOC1_IN_PD8 \
	GD32_PINMUX_AF('D', 8, AF11)
#define GTOC1_IN_PE14 \
	GD32_PINMUX_AF('E', 14, AF11)
#define GTOC1_IN_PF12 \
	GD32_PINMUX_AF('F', 12, AF11)
#define GTOC1_IN_PG12 \
	GD32_PINMUX_AF('G', 12, AF11)

/* GTOC2_IN */
#define GTOC2_IN_PA1 \
	GD32_PINMUX_AF('A', 1, AF12)
#define GTOC2_IN_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)
#define GTOC2_IN_PD8 \
	GD32_PINMUX_AF('D', 8, AF12)
#define GTOC2_IN_PE14 \
	GD32_PINMUX_AF('E', 14, AF12)
#define GTOC2_IN_PF12 \
	GD32_PINMUX_AF('F', 12, AF12)
#define GTOC2_IN_PG11 \
	GD32_PINMUX_AF('G', 11, AF11)

/* GTOC3_IN */
#define GTOC3_IN_PA1 \
	GD32_PINMUX_AF('A', 1, AF13)
#define GTOC3_IN_PD8 \
	GD32_PINMUX_AF('D', 8, AF13)
#define GTOC3_IN_PE14 \
	GD32_PINMUX_AF('E', 14, AF13)
#define GTOC3_IN_PF12 \
	GD32_PINMUX_AF('F', 12, AF13)

/* I2C0_SCL */
#define I2C0_SCL_PF9 \
	GD32_PINMUX_AF('F', 9, AF8)

/* I2C0_SDA */
#define I2C0_SDA_PF8 \
	GD32_PINMUX_AF('F', 8, AF7)
#define I2C0_SDA_PF10 \
	GD32_PINMUX_AF('F', 10, AF8)

/* I2C0_SMBA */
#define I2C0_SMBA_PF8 \
	GD32_PINMUX_AF('F', 8, AF8)
#define I2C0_SMBA_PF10 \
	GD32_PINMUX_AF('F', 10, AF7)

/* JTCK */
#define JTCK_PG12 \
	GD32_PINMUX_AF('G', 12, ANALOG)

/* JTDI */
#define JTDI_PG13 \
	GD32_PINMUX_AF('G', 13, ANALOG)

/* JTDO */
#define JTDO_PG11 \
	GD32_PINMUX_AF('G', 11, ANALOG)

/* JTMS */
#define JTMS_PG14 \
	GD32_PINMUX_AF('G', 14, ANALOG)

/* NJTRST */
#define NJTRST_PG15 \
	GD32_PINMUX_AF('G', 15, ANALOG)

/* NMI */
#define NMI_PN2 \
	GD32_PINMUX_AF('N', 2, ANALOG)

/* NRST */
#define NRST_PN5 \
	GD32_PINMUX_AF('N', 5, ANALOG)

/* OSCIN */
#define OSCIN_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)

/* OSCOUT */
#define OSCOUT_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)

/* POC_IN0 */
#define POC_IN0_PD8 \
	GD32_PINMUX_AF('D', 8, AF6)

/* POC_IN1 */
#define POC_IN1_PE14 \
	GD32_PINMUX_AF('E', 14, AF6)

/* POC_IN2 */
#define POC_IN2_PF12 \
	GD32_PINMUX_AF('F', 12, AF4)

/* POC_IN3 */
#define POC_IN3_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)

/* POC_IN4 */
#define POC_IN4_PN2 \
	GD32_PINMUX_AF('N', 2, AF6)

/* POC_IN5 */
#define POC_IN5_PA1 \
	GD32_PINMUX_AF('A', 1, AF4)

/* SPI0_IO2 */
#define SPI0_IO2_PF9 \
	GD32_PINMUX_AF('F', 9, AF9)

/* SPI0_IO3 */
#define SPI0_IO3_PF10 \
	GD32_PINMUX_AF('F', 10, AF9)

/* SPI0_MISO */
#define SPI0_MISO_PB2 \
	GD32_PINMUX_AF('B', 2, AF11)
#define SPI0_MISO_PF12 \
	GD32_PINMUX_AF('F', 12, AF9)

/* SPI0_MOSI */
#define SPI0_MOSI_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)
#define SPI0_MOSI_PF8 \
	GD32_PINMUX_AF('F', 8, AF9)

/* SPI0_NSS */
#define SPI0_NSS_PD8 \
	GD32_PINMUX_AF('D', 8, AF9)
#define SPI0_NSS_PG14 \
	GD32_PINMUX_AF('G', 14, AF9)
#define SPI0_NSS_PG15 \
	GD32_PINMUX_AF('G', 15, AF9)

/* SPI0_SCK */
#define SPI0_SCK_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)
#define SPI0_SCK_PF11 \
	GD32_PINMUX_AF('F', 11, AF9)

/* SWCLK */
#define SWCLK_PG12 \
	GD32_PINMUX_AF('G', 12, ANALOG)
#define SWCLK_PN2 \
	GD32_PINMUX_AF('N', 2, ANALOG)

/* SWDIO */
#define SWDIO_PG13 \
	GD32_PINMUX_AF('G', 13, ANALOG)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PD8 \
	GD32_PINMUX_AF('D', 8, AF7)

/* TIMER0_CH0 */
#define TIMER0_CH0_PD9 \
	GD32_PINMUX_AF('D', 9, AF1)

/* TIMER0_CH0_INV */
#define TIMER0_CH0_INV_PD9 \
	GD32_PINMUX_AF('D', 9, AF3)

/* TIMER0_CH1 */
#define TIMER0_CH1_PD10 \
	GD32_PINMUX_AF('D', 10, AF1)

/* TIMER0_CH1_INV */
#define TIMER0_CH1_INV_PD10 \
	GD32_PINMUX_AF('D', 10, AF3)

/* TIMER0_CH2 */
#define TIMER0_CH2_PD11 \
	GD32_PINMUX_AF('D', 11, AF1)

/* TIMER0_CH2_INV */
#define TIMER0_CH2_INV_PD11 \
	GD32_PINMUX_AF('D', 11, AF3)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)

/* TIMER0_CH3_INV */
#define TIMER0_CH3_INV_PA9 \
	GD32_PINMUX_AF('A', 9, AF3)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF1)

/* TIMER0_MCH0_INV */
#define TIMER0_MCH0_INV_PD12 \
	GD32_PINMUX_AF('D', 12, AF3)

/* TIMER0_MCH1 */
#define TIMER0_MCH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF1)

/* TIMER0_MCH1_INV */
#define TIMER0_MCH1_INV_PD13 \
	GD32_PINMUX_AF('D', 13, AF3)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF1)

/* TIMER0_MCH2_INV */
#define TIMER0_MCH2_INV_PD14 \
	GD32_PINMUX_AF('D', 14, AF3)

/* TIMER0_MCH3 */
#define TIMER0_MCH3_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER0_MCH3_INV */
#define TIMER0_MCH3_INV_PC8 \
	GD32_PINMUX_AF('C', 8, AF4)

/* TIMER1_CH0 */
#define TIMER1_CH0_PD8 \
	GD32_PINMUX_AF('D', 8, AF1)
#define TIMER1_CH0_PF11 \
	GD32_PINMUX_AF('F', 11, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PF10 \
	GD32_PINMUX_AF('F', 10, AF1)
#define TIMER1_CH1_PG13 \
	GD32_PINMUX_AF('G', 13, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define TIMER1_CH2_PF9 \
	GD32_PINMUX_AF('F', 9, AF1)
#define TIMER1_CH2_PG11 \
	GD32_PINMUX_AF('G', 11, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PF8 \
	GD32_PINMUX_AF('F', 8, AF1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER2_CH0_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER2_CH0_PG13 \
	GD32_PINMUX_AF('G', 13, AF3)
#define TIMER2_CH0_PG15 \
	GD32_PINMUX_AF('G', 15, AF1)

/* TIMER2_CH1 */
#define TIMER2_CH1_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define TIMER2_CH1_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER2_CH1_PG12 \
	GD32_PINMUX_AF('G', 12, AF3)

/* TIMER2_CH2 */
#define TIMER2_CH2_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER2_CH2_PF14 \
	GD32_PINMUX_AF('F', 14, AF1)
#define TIMER2_CH2_PG11 \
	GD32_PINMUX_AF('G', 11, AF3)
#define TIMER2_CH2_PG14 \
	GD32_PINMUX_AF('G', 14, AF1)

/* TIMER2_CH3 */
#define TIMER2_CH3_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)
#define TIMER2_CH3_PF13 \
	GD32_PINMUX_AF('F', 13, AF3)
#define TIMER2_CH3_PN7 \
	GD32_PINMUX_AF('N', 7, AF1)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PE14 \
	GD32_PINMUX_AF('E', 14, AF7)

/* TIMER7_CH0 */
#define TIMER7_CH0_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* TIMER7_CH0_INV */
#define TIMER7_CH0_INV_PE13 \
	GD32_PINMUX_AF('E', 13, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)

/* TIMER7_CH1_INV */
#define TIMER7_CH1_INV_PE12 \
	GD32_PINMUX_AF('E', 12, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* TIMER7_CH2_INV */
#define TIMER7_CH2_INV_PE11 \
	GD32_PINMUX_AF('E', 11, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PE11 \
	GD32_PINMUX_AF('E', 11, AF2)

/* TIMER7_CH3_INV */
#define TIMER7_CH3_INV_PE11 \
	GD32_PINMUX_AF('E', 11, AF4)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)

/* TIMER7_MCH0_INV */
#define TIMER7_MCH0_INV_PE10 \
	GD32_PINMUX_AF('E', 10, AF3)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* TIMER7_MCH1_INV */
#define TIMER7_MCH1_INV_PE9 \
	GD32_PINMUX_AF('E', 9, AF3)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER7_MCH2_INV */
#define TIMER7_MCH2_INV_PE8 \
	GD32_PINMUX_AF('E', 8, AF3)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PE10 \
	GD32_PINMUX_AF('E', 10, AF2)

/* TIMER7_MCH3_INV */
#define TIMER7_MCH3_INV_PE10 \
	GD32_PINMUX_AF('E', 10, AF4)

/* TIMER_ETI0 */
#define TIMER_ETI0_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)

/* TIMER_ETI1 */
#define TIMER_ETI1_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)

/* TIMER_ETI2 */
#define TIMER_ETI2_PA9 \
	GD32_PINMUX_AF('A', 9, AF2)
#define TIMER_ETI2_PD8 \
	GD32_PINMUX_AF('D', 8, AF2)

/* TIMER_ETI3 */
#define TIMER_ETI3_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)

/* TRACESWO */
#define TRACESWO_PG11 \
	GD32_PINMUX_AF('G', 11, ANALOG)

/* TSEL */
#define TSEL_PN7 \
	GD32_PINMUX_AF('N', 7, ANALOG)

/* UART0_RX */
#define UART0_RX_PG13 \
	GD32_PINMUX_AF('G', 13, AF6)

/* UART0_TX */
#define UART0_TX_PG11 \
	GD32_PINMUX_AF('G', 11, AF6)

/* UART1_RX */
#define UART1_RX_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)
#define UART1_RX_PF14 \
	GD32_PINMUX_AF('F', 14, AF6)

/* UART1_TX */
#define UART1_TX_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define UART1_TX_PF13 \
	GD32_PINMUX_AF('F', 13, AF6)
#define UART1_TX_PG15 \
	GD32_PINMUX_AF('G', 15, AF6)

/* UART2_RX */
#define UART2_RX_PF9 \
	GD32_PINMUX_AF('F', 9, AF6)

/* UART2_TX */
#define UART2_TX_PF8 \
	GD32_PINMUX_AF('F', 8, AF6)
#define UART2_TX_PF10 \
	GD32_PINMUX_AF('F', 10, AF6)

/* UART3_RX */
#define UART3_RX_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)
#define UART3_RX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define UART3_RX_PB2 \
	GD32_PINMUX_AF('B', 2, AF10)
#define UART3_RX_PC9 \
	GD32_PINMUX_AF('C', 9, AF7)
#define UART3_RX_PF12 \
	GD32_PINMUX_AF('F', 12, AF7)
#define UART3_RX_PF14 \
	GD32_PINMUX_AF('F', 14, AF7)
#define UART3_RX_PG14 \
	GD32_PINMUX_AF('G', 14, AF7)

/* UART3_TX */
#define UART3_TX_PA1 \
	GD32_PINMUX_AF('A', 1, AF6)
#define UART3_TX_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)
#define UART3_TX_PC8 \
	GD32_PINMUX_AF('C', 8, AF7)
#define UART3_TX_PF11 \
	GD32_PINMUX_AF('F', 11, AF7)
#define UART3_TX_PF13 \
	GD32_PINMUX_AF('F', 13, AF7)
#define UART3_TX_PG12 \
	GD32_PINMUX_AF('G', 12, AF7)

/* WKUP1 */
#define WKUP1_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
